mikeakohn/naken_asm/include/8051/stc89xx.inc
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;
;; STC89xx/STC90xx include
;; part of the naken_asm assembler
;;
;; Generated by: Cjacker Huang (cjacker@gmail.com)
;;         Date: 2022-05-21
;;        Parts: STC89xx / STC90xx
;;
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

XICON equ 0xc0
WDT_CONTR equ 0xe1
ISP_DATA equ 0xe2
ISP_ADDRH equ 0xe3
ISP_ADDRL equ 0xe4
ISP_CMD equ 0xe5
ISP_TRIG equ 0xe6
ISP_CONTR equ 0xe7
AUXR1 equ 0xA2
SADDR equ 0xA9
IPH equ 0xB7
SADEN equ 0xB9
T2CON equ 0xC8
T2MOD equ 0xC9
RCAP2L equ 0xCA
RCAP2H equ 0xCB
TL2 equ 0xCC
TH2 equ 0xCD

; bit aliases

CY equ 0xD0+7
AC equ 0xD0+6
F0 equ 0xD0+5
RS1 equ 0xD0+4
RS0 equ 0xD0+3
OV equ 0xD0+2
F1 equ 0xD0+1
P equ 0xD0+0
TF1 equ 0x88+7
TR1 equ 0x88+6
TF0 equ 0x88+5
TR0 equ 0x88+4
IE1 equ 0x88+3
IT1 equ 0x88+2
IE0 equ 0x88+1
IT0 equ 0x88+0
EA equ 0xA8+7
EC equ 0xA8+6
ET2 equ 0xA8+5
ES equ 0xA8+4
ET1 equ 0xA8+3
EX1 equ 0xA8+2
ET0 equ 0xA8+1
EX0 equ 0xA8+0
PT2 equ 0xB8+5
PS equ 0xB8+4
PT1 equ 0xB8+3
PX1 equ 0xB8+2
PT0 equ 0xB8+1
PX0 equ 0xB8+0
RD equ 0xB0+7
WR equ 0xB0+6
T1 equ 0xB0+5
T0 equ 0xB0+4
INT1 equ 0xB0+3
INT0 equ 0xB0+2
TXD equ 0xB0+1
RXD equ 0xB0+0
SM0 equ 0x98+7
FE equ 0x98+7
SM1 equ 0x98+6
SM2 equ 0x98+5
REN equ 0x98+4
TB8 equ 0x98+3
RB8 equ 0x98+2
TI equ 0x98+1
RI equ 0x98+0
T2EX equ 0x90+1
T2 equ 0x90+0
TF2 equ 0xC8+7
EXF2 equ 0xC8+6
RCLK equ 0xC8+5
TCLK equ 0xC8+4
EXEN2 equ 0xC8+3
TR2 equ 0xC8+2
C_T2 equ 0xC8+1
CP_RL2 equ 0xC8+0

; xdata

